load-test-results/ab-go-output.log
➜  ~ ab -c 100 -n 1000 http://go-basic-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com/
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking go-basic-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        go-basic-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com
Server Port:            80

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      100
Time taken for tests:   2.686 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      250000 bytes
HTML transferred:       12000 bytes
Requests per second:    372.32 [#/sec] (mean)
Time per request:       268.586 [ms] (mean)
Time per request:       2.686 [ms] (mean, across all concurrent requests)
Transfer rate:          90.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      103  117   5.6    117     130
Processing:   103  121   8.5    120     151
Waiting:      103  121   8.5    120     150
Total:        210  237  12.3    238     271

Percentage of the requests served within a certain time (ms)
  50%    238
  66%    244
  75%    246
  80%    247
  90%    252
  95%    263
  98%    267
  99%    268
 100%    271 (longest request)