load-test-results/ab-nodejs-output.log
➜  ~ ab -c 100 -n 1000 http://nodejs-basic-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com/
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking nodejs-basic-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        nodejs-basic-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com
Server Port:            80

Document Path:          /
Document Length:        39 bytes

Concurrency Level:      100
Time taken for tests:   2.788 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      383000 bytes
HTML transferred:       39000 bytes
Requests per second:    358.64 [#/sec] (mean)
Time per request:       278.829 [ms] (mean)
Time per request:       2.788 [ms] (mean, across all concurrent requests)
Transfer rate:          134.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      101  116   6.0    116     135
Processing:   103  128  28.2    120     258
Waiting:      103  128  28.2    119     258
Total:        206  244  30.8    238     383

Percentage of the requests served within a certain time (ms)
  50%    238
  66%    244
  75%    248
  80%    252
  90%    275
  95%    311
  98%    370
  99%    379
 100%    383 (longest request)