load-test-results/ab-quarkus-output.log
➜  ~ ab -c 100 -n 1000 http://code-with-quarkus-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com/
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking code-with-quarkus-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        code-with-quarkus-garima-joshi-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com
Server Port:            80

Document Path:          /
Document Length:        5254 bytes

Concurrency Level:      100
Time taken for tests:   4.815 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      5598000 bytes
HTML transferred:       5254000 bytes
Requests per second:    207.67 [#/sec] (mean)
Time per request:       481.540 [ms] (mean)
Time per request:       4.815 [ms] (mean, across all concurrent requests)
Transfer rate:          1135.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      106  118   5.8    119     141
Processing:   106  294 130.4    271     675
Waiting:      106  293 130.5    270     674
Total:        216  412 130.9    391     799

Percentage of the requests served within a certain time (ms)
  50%    391
  66%    415
  75%    499
  80%    510
  90%    604
  95%    692
  98%    703
  99%    795
 100%    799 (longest request)